Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
T]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-szfch9a966-rtslms-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-szfch9a966-rtslms-POST]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-szfch9a966-7yk3wr-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-szfch9a966-8fqa5k-POST]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-szfch9a966-0uv90c-GET]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-szfch9a966-r52to9-POST]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-szfch9a966-0y1qmv-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-szfch9a966-0y1qmv-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-szfch9a966-2lgphh-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-szfch9a966-6dxn63-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-szfch9a966-2lgphh-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-szfch9a966-6dxn63-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-szfch9a966-z72aqb-GET]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-szfch9a966-8hpwjc-GET]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-szfch9a966-8hpwjc-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-szfch9a966-la2ahf-GET]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-szfch9a966-la2ahf-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-szfch9a966-z72aqb-POST]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-szfch9a966-6jbybg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-szfch9a966-v36ec6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-szfch9a966-v36ec6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-szfch9a966-zqk6qo-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-szfch9a966-xtj9zp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-szfch9a966-zqk6qo-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-szfch9a966-6jbybg-GET-200]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-szfch9a966-11iesn-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-szfch9a966-w6lt56-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-szfch9a966-w6lt56-GET]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-szfch9a966-cv7mcg-GET]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-szfch9a966-x5f369-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-szfch9a966-11iesn-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-szfch9a966-8ddmga-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-szfch9a966-nr8u7a-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-szfch9a966-cv7mcg-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-szfch9a966-8ddmga-GET]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-szfch9a966-x5f369-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-szfch9a966-nr8u7a-POST]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-szfch9a966-icfu1j-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-szfch9a966-icfu1j-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-xtj9zp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-szfch9a966-16lkxa-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-szfch9a966-68tg4t-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-szfch9a966-qomaof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-szfch9a966-n4jlmv-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-szfch9a966-n4jlmv-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-szfch9a966-qomaof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-szfch9a966-16lkxa-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-szfch9a966-68tg4t-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-i11512-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-szfch9a966-i11512-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-szfch9a966-7yk3wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-szfch9a966-8fqa5k-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-szfch9a966-0uv90c-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-szfch9a966-rtslms-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-szfch9a966-8fqa5k-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-szfch9a966-rtslms-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-szfch9a966-0uv90c-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-szfch9a966-7yk3wr-POST-200]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-szfch9a966-x2zbcc-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-szfch9a966-t7iyo8-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-szfch9a966-aw26bn-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-szfch9a966-75kns4-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-szfch9a966-aw26bn-GET]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-szfch9a966-75kns4-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-szfch9a966-t7iyo8-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-szfch9a966-x2zbcc-POST]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-szfch9a966-0y1qmv-GET-200]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-szfch9a966-r52to9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-0y1qmv-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-szfch9a966-6dxn63-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-szfch9a966-2lgphh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-szfch9a966-z72aqb-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-szfch9a966-8hpwjc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-szfch9a966-6dxn63-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-szfch9a966-z72aqb-POST-200]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-szfch9a966-c3evtv-ANY]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-post: Refreshing state... [id=agir-xka9g7txth-fwyevs-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-szfch9a966-2lgphh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-szfch9a966-la2ahf-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-8hpwjc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-szfch9a966-w6lt56-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-szfch9a966-w6lt56-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-szfch9a966-11iesn-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-szfch9a966-x5f369-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-szfch9a966-cv7mcg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-szfch9a966-8ddmga-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-szfch9a966-x5f369-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-nr8u7a-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-szfch9a966-la2ahf-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-szfch9a966-8ddmga-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-szfch9a966-nr8u7a-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-szfch9a966-cv7mcg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-szfch9a966-x2zbcc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-szfch9a966-75kns4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-szfch9a966-75kns4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-szfch9a966-t7iyo8-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-szfch9a966-x2zbcc-POST-200]
module.sbeacon.module.cors-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-szfch9a966-75kns4-OPTIONS-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-szfch9a966-aw26bn-POST-200]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-szfch9a966-c3evtv-ANY-200]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-lookup:pgxflow-backend-lookup-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-postprocessor:pgxflow-backend-postprocessor-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-lookup.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-lookup]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-postprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-postprocessor]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-szfch9a966-aw26bn-GET-200]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPostprocessorInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-preprocessor]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat: Refreshing state... [id=PGxFlowBackendAllowLambdaPharmcatInvoke]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-szfch9a966-t7iyo8-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-szfch9a966-11iesn-POST-200]
module.pgxflow[0].aws_api_gateway_integration_response.vcfstats-patch: Refreshing state... [id=agir-xka9g7txth-fwyevs-PATCH-200]
module.pgxflow[0].aws_api_gateway_deployment.PgxApi: Refreshing state... [id=044v31]
module.pgxflow[0].aws_api_gateway_stage.PgxApi: Refreshing state... [id=ags-xka9g7txth-prod]
module.pgxflow[0].aws_api_gateway_method_settings.PgxApi: Refreshing state... [id=xka9g7txth-prod-*/*]
module.pgxflow[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2EH3IJ2O1Y6GV]
module.sbeacon.aws_api_gateway_method_response.datasets-id: Refreshing state... [id=agmr-szfch9a966-r52to9-GET-200]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-szfch9a966-r52to9-GET]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-szfch9a966-r52to9-GET-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=yehk8f]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-szfch9a966-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=szfch9a966-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1VZY9FM3SJBCP]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=69e328f4-3e3e-4b6c-8593-85a773947ad1]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E1JX27UC7IBGFE]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=71015459-5773-a0d3-165d-f663264fa273]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250521064143904900000001]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Still reading... [1m20s elapsed]
module.webgui.data.external.build: Read complete after 1m30s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=7735659227283189133]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=4527469838895437770]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.pgxflow[0].archive_file.binaries_layer has changed
  ~ resource "archive_file" "binaries_layer" {
        id                  = "c4353fcd14488922d6773d38a1bc1ebfc0e2c5fe"
      ~ output_base64sha256 = "QQXe/fDtcF4zpy8EpzoFeGqLfVsAJJLPUQhcg1oa2yE=" -> "dSo3IogmRNxnML9AB/THEU8WKv+wvuT7Ah8BPUXqXJo="
        # (9 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4fe315e2d07867510687aae5aa4758b113c7ef4c82043c1f91e529536a3110cf727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:4fe315e2d07867510687aae5aa4758b113c7ef4c82043c1f91e529536a3110cf" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:6e15a69013f79efdaa49977229327197885d87f85ab0d30a1f286a87535c7e91727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:6e15a69013f79efdaa49977229327197885d87f85ab0d30a1f286a87535c7e91" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-dbsnp"
      ~ last_modified                  = "2025-07-15T02:47:13.000+0000" -> "2025-07-15T02:48:41.000+0000"
      ~ source_code_size               = 1788 -> 1791
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_pharmcat_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:4fd66c0eaecaffab42fe784cfed5a37b676f764bb215548d22aa323af9a0b8de727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers"
      - image_id     = "sha256:4fd66c0eaecaffab42fe784cfed5a37b676f764bb215548d22aa323af9a0b8de" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-pharmcat-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.module.docker_image_preprocessor_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:26eeeb51095a21677dbb53aa6c6f168ad76ab0bef5bf3d277c61d1c113e8be99727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers"
      - image_id     = "sha256:26eeeb51095a21677dbb53aa6c6f168ad76ab0bef5bf3d277c61d1c113e8be99" -> null
      - name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-preprocessor-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_backup_plan.gaspi_backup_plan will be updated in-place
  ~ resource "aws_backup_plan" "gaspi_backup_plan" {
        id       = "357f3780-6d71-4e9a-aa81-59266834cbfe"
        name     = "gaspi_backup_plan"
      ~ tags     = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_backup_vault.gaspi_backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "gaspi_backup_vault" {
        id              = "gaspi_backup_vault"
        name            = "gaspi_backup_vault"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c",
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger",
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "727260606489",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be updated in-place
  ~ resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
        id                               = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
      ~ tags                             = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be updated in-place
  ~ resource "aws_cognito_user_pool" "gaspi_user_pool" {
        id                         = "ap-southeast-3_sNjfbidkU"
        name                       = "gaspi-users"
      ~ tags                       = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all                   = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

      - schema {
          - attribute_data_type      = "String" -> null
          - developer_only_attribute = false -> null
          - mutable                  = true -> null
          - name                     = "identity_id" -> null
          - required                 = false -> null

          - string_attribute_constraints {}
        }
      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "is_medical_director"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

        # (9 unchanged blocks hidden)
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "admin_group_role_policy" {
        id               = "arn:aws:iam::727260606489:policy/gaspi-admin-group-role-policy"
        name             = "gaspi-admin-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "manager_group_role_policy" {
        id               = "arn:aws:iam::727260606489:policy/gaspi-manager-group-role-policy"
        name             = "gaspi-manager-group-role-policy"
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.admin_group_role will be updated in-place
  ~ resource "aws_iam_role" "admin_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-admin-group-role"
        name                  = "gaspi-admin-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_authenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_authenticated"
        name                  = "gaspi_authenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be updated in-place
  ~ resource "aws_iam_role" "gaspi_unauthenticated" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "unauthenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi_unauthenticated"
        name                  = "gaspi_unauthenticated"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.aws_iam_role.manager_group_role will be updated in-place
  ~ resource "aws_iam_role" "manager_group_role" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - "ForAnyValue:StringLike" = {
                              - "cognito-identity.amazonaws.com:amr" = "authenticated"
                            }
                          - StringEquals             = {
                              - "cognito-identity.amazonaws.com:aud" = "ap-southeast-3:5ffaac62-7bf8-4f6c-a6bc-f0c81f0c2e8c"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "cognito-identity.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "gaspi-manager-group-role"
        name                  = "gaspi-manager-group-role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic" "sesDeliveryLogger" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
        name                                     = "sesDeliveryLogger"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be updated in-place
  ~ resource "aws_sns_topic_policy" "sesDeliveryLogger" {
        id     = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sns:Publish"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceAccount" = "727260606489"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ses.amazonaws.com"
                        }
                      - Resource  = "arn:aws:sns:ap-southeast-3:727260606489:sesDeliveryLogger"
                      - Sid       = "AllowSESToPublishToSNS"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.error-catcher.data.aws_iam_policy_document.lambda-notifyOnError will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-notifyOnError" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cloudwatch:DescribeAlarms",
            ]
          + resources = [
              + "arn:aws:cloudwatch:ap-southeast-3:727260606489:alarm:error-catcher-notifyOnError",
            ]
        }
      + statement {
          + actions   = [
              + "events:describeRule",
              + "events:disableRule",
              + "events:enableRule",
            ]
          + resources = [
              + "arn:aws:events:ap-southeast-3:727260606489:rule/error-catcher-notifyOnError-trigger",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::error-catcher-recent-errors-20250707234226378900000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricData",
              + "cloudwatch:ListMetrics",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:FilterLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:ap-southeast-3:727260606489:log-group:/aws/lambda/*",
            ]
        }
      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:727260606489:configuration-set/*",
              + "arn:aws:ses:ap-southeast-3:727260606489:identity/*",
            ]
        }
    }

  # module.error-catcher.aws_cloudwatch_event_rule.notifyOnError-trigger will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "notifyOnError-trigger" {
        id                  = "error-catcher-notifyOnError-trigger"
        name                = "error-catcher-notifyOnError-trigger"
      ~ tags                = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all            = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.error-catcher.aws_cloudwatch_metric_alarm.notifyOnError-alarm will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "notifyOnError-alarm" {
        id                                    = "error-catcher-notifyOnError"
      ~ tags                                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (22 unchanged attributes hidden)
    }

  # module.error-catcher.aws_s3_bucket.recent-errors will be updated in-place
  ~ resource "aws_s3_bucket" "recent-errors" {
        id                          = "error-catcher-recent-errors-20250707234226378900000001"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.error-catcher.aws_sns_topic.notifyOnError will be updated in-place
  ~ resource "aws_sns_topic" "notifyOnError" {
        id                                       = "arn:aws:sns:ap-southeast-3:727260606489:error-catcher-notifyOnError"
        name                                     = "error-catcher-notifyOnError"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.pgxflow[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:GetAccountSettings",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:GetMetricStatistics",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-batchSubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-batchSubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:SendMessage",
              + "sqs:SendMessageBatch",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].data.aws_iam_policy_document.lambda-initFlow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initFlow" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*",
              + "arn:aws:s3:::pgxflow-backend-references-20250521064131152100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/pgxflow-references",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.pgxflow[0].aws_api_gateway_deployment.PgxApi must be replaced
+/- resource "aws_api_gateway_deployment" "PgxApi" {
      ~ created_date = "2025-07-07T23:45:10Z" -> (known after apply)
      ~ id           = "044v31" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "46b707e994db8ec08a5508dcae1d654ef5fd8e49"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-options will be created
  + resource "aws_api_gateway_integration" "batch-submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.batch-submit-post will be created
  + resource "aws_api_gateway_integration" "batch-submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.results-options will be created
  + resource "aws_api_gateway_integration" "results-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-options will be created
  + resource "aws_api_gateway_integration" "submit-options" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + region               = "ap-southeast-3"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "xka9g7txth"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-southeast-3"
      + resource_id             = (known after apply)
      + rest_api_id             = "xka9g7txth"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.batch-submit-options will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.batch-submit-post will be created
  + resource "aws_api_gateway_integration_response" "batch-submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.results-options will be created
  + resource "aws_api_gateway_integration_response" "results-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,GET'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-options will be created
  + resource "aws_api_gateway_integration_response" "submit-options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,X-Amz-Date,Authorization,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,PATCH,POST'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + response_templates  = {
          + "application/json" = null
        }
      + rest_api_id         = "xka9g7txth"
      + status_code         = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "xka9g7txth"
      + status_code        = "200"
    }

  # module.pgxflow[0].aws_api_gateway_method.batch-submit-options will be created
  + resource "aws_api_gateway_method" "batch-submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.batch-submit-post will be created
  + resource "aws_api_gateway_method" "batch-submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "nk0u8b"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.results-options will be created
  + resource "aws_api_gateway_method" "results-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = "xka9g7txth"
    }

  # module.pgxflow[0].aws_api_gateway_method.submit-options will be created
  + resource "aws_api_gateway_method" "submit-options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + i
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.